Repository: 84000/data-translation-memory
Catalog: Toh_78-The_Questions_of_Gunaratnasankusumita-v2.tmx
Source language: bo
Languages: en

source: ས་ནས་ས་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will also progress through the levels.

source: ཚིག་གཟུང་བར་འོས་པ་ཉིད་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain speech that is worthy of being accepted.

source: སྤོབས་པ་བུལ་བ་མེད་པ་ཕུན་སུམ་ཚོགས་པ་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain excellent eloquence free from hesitation.

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: They will swiftly and fully awaken to unexcelled and perfect buddhahood.

source: ཡི་གེ་དང་སྒྲའི་བརྡ་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will understand the symbols of letters and sounds.

source: རིགས་མཐོན་པོ་དང་རིགས་ཆེན་པོ་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain lofty castes and exalted lineages.

source: མངོན་པར་ཤེས་པ་ལྔ་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain the five superknowledges.

source: ཚེ་རབས་དྲན་པར་ཡང་འགྱུར་རོ། །
en: They will remember their former lives.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །
en: They will attain the eighteen unique qualities of the buddhas.

source: གང་ཞིག་རྒྱལ་བའི་མཚན་མཆོག་འཛིན་བྱེད་པ། །དེ་ནི་ཡན་ལག་བརྒྱད་དབྱངས་ཕུན་སུམ་འཐོབ། །
en: “ ‘Those who remember the supreme name of this victor Will attain perfect speech endowed with the eight aspects,

source: དེ་ནི་སངས་རྒྱས་བྲལ་བར་ཡང་མི་སྐྱེ། །
en: And they will never be reborn where there is no buddha.

source: མི་དེ་མི་ཐོགས་བྱང་ཆུབ་འཚང་རྒྱར་འགྱུར། །
en: Such individuals will awaken to buddhahood without hindrance.’

source: ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་འོག་གི་ཕྱོགས་ན།
en: “Guṇaratnasaṅkusumita, below here is a world system known as Delighting in Inseparability.

source: ཐ་དད་པ་མེད་པ་ཉིད་ལ་དགའ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་རྣམ་པར་འཕྲུལ་པའི་གཟི་བརྗིད་ཀྱི་འོད་ཅེས་བྱ་བ་ཞིག་ད་ལྟར་བཞུགས་ཏེའཚོ་ཞིང་གཞེས་པ་ཡོད་དོ། །
en: There, the thus-gone, worthy, perfect Buddha Splendorous Light Manifesting in the Manner of All Phenomena abides, alive and well.

source: བསྐལ་པ་དེ་ནི་ཡེ་ཤེས་ཀུན་ནས་བསྡུས་པ་ཞེས་བྱའོ། །
en: That eon is known as Gathering of Wisdom.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་རྣམ་པར་འཕྲུལ་པའི་གཟི་བརྗིད་ཀྱི་འོད་དེའི་མཚན་འཛིན་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་དེའི་ཚེ་རྗེས་མ་ཐག་ཏུ་སངས་རྒྱས་ཡོངས་སུ་འགྲུབ་པ་ཞེས་བྱ་བའི་གཟུངས་འཐོབ་པར་འགྱུར་རོ། །
en: The faithful noble sons and daughters who remember the name of the blessed, thus-gone, worthy, perfect Buddha Splendorous Light Manifesting in the Manner of All Phenomena will, immediately in their next lives, attain the dhāraṇī called accomplishing buddhahood .

source: སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: With just one rebirth remaining, they will fully awaken to unexcelled and perfect buddhahood.

source: སངས་རྒྱས་བྱེ་བ་ཕྲག་དགུ་བཅུའི་ཆོས་བསྟན་པ་ཡང་ཐོས་པར་འགྱུར་རོ། །
en: They will hear the Dharma teachings of ninety million buddhas,

source: ཐོས་ནས་ཀྱང་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་པར་འགྱུར་རོ། །
en: and, upon hearing them, they will remember them all.

source: སངས་རྒྱས་མཚན་འཛིན་སངས་རྒྱས་བྱེ་བ་ཕྲག །དགུ་བཅུ་རྣམས་ཀྱི་ཆོས་བསྟན་ཐོས་འགྱུར་ཞིང་། །སྐྱེ་བ་གཅིག་ཐོགས་བླ་ན་མེད་པ་ཡི། །བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱར་འགྱུར། །
en: “ ‘Those who remember the name of this buddha Will hear the teachings of ninety million buddhas, Will have just one birth remaining, And will fully awaken to unexcelled and perfect buddhahood.’ ”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་ཐམས་ཅད་དང་ལྡན་པའི་སྤོབས་པའི་སྐད་ཀྱིས་གཟུངས་འཐོབ་པར་གྱུར་ཏོ། །
en: Then the bodhisattva great being Guṇaratnasaṅkusumita, as well as the bodhisattva great being Eloquent Voice Endowed with All Precious Qualities, attained dhāraṇī.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་བོ། །ལྷ་དང་མིའི་སྐྱེ་དགུ་སུམ་ཁྲིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Eighty million bodhisattvas attained the level of progressing irreversibly toward unexcelled and perfect awakening, and thirty thousand gods and humans aroused the mind set upon unexcelled and perfect awakening.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: After the Blessed One said those words,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: the bodhisattva great being Guṇaratnasaṅkusumita, the entire assembly, and the world with its gods, humans, asuras, and gandharvas rejoiced and praised the Buddha’s words.

source: འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས། ཡོན་ཏན་རིན་ཆེན་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པས་ཞུས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་རྩ་བཞི་པ་རྫོགས་སོ།། །།
en: This concludes the section of “The Questions of Guṇaratnasaṅkusumita,” the thirty-fourth section of “The Noble Dharma Discourse, the Great Heap of Jewels,” in one hundred thousand sections.

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། པྲ་ཛྙ་བར་མ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: This text was translated, edited, and finalized by the Indian scholars Jinamitra and Prajñāvarman, as well as the chief editor-translator Bandé Yeshé Dé and others.
